## we use pandas for data analysis
  * series
  * dataframes
  * missing data
  * groupBy 
  * operation
  * merging,joining and concatination
  * data inputs and output

# series
 * load the library
 * series takes the attribute pd(data,series)

In [2]:
import numpy as np
import pandas as pd

# creating a series

In [3]:
labels = ['a','b','c']
my_list = [10,20,20]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':20}
pd.Series(data=my_list)

0    10
1    20
2    20
dtype: int64

In [4]:
pd.Series(data=my_list)

0    10
1    20
2    20
dtype: int64

In [5]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    20
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    10
b    20
c    20
dtype: int64

In [7]:
pd.Series(labels,my_list)

10    a
20    b
20    c
dtype: object

In [8]:
import pandas as pd
labels= ['a','b','c']
my_datta=[[10,11,12,13],[14,15,16,17],[19,20,21,0]]
pd.Series(data=my_datta,index=labels)

a    [10, 11, 12, 13]
b    [14, 15, 16, 17]
c     [19, 20, 21, 0]
dtype: object

In [9]:
# dictionary assigns value and key
# dictionary to series
pd.Series(d)

a    10
b    20
c    20
dtype: int64

In [10]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [11]:
series1=pd.Series([1,2,3,4],index = ['mombasa','kitale','nakuru','migori'])
series1

mombasa    1
kitale     2
nakuru     3
migori     4
dtype: int64

In [12]:
series1=pd.Series(index = ['mombasa','kitale','nakuru','migori'],data=[1,2,3,4])
series1

mombasa    1
kitale     2
nakuru     3
migori     4
dtype: int64

In [13]:
series2=pd.Series([1,2,3,4],index=['mombasa','nairobi','naivasha','migori'])

In [14]:
series2

mombasa     1
nairobi     2
naivasha    3
migori      4
dtype: int64

In [15]:
# series operation
series1+series2

kitale      NaN
migori      8.0
mombasa     2.0
nairobi     NaN
naivasha    NaN
nakuru      NaN
dtype: float64

In [16]:
# array takes one datatype

# Data Frames

In [17]:
from numpy.random import randn
np.random.seed(101)

In [18]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
#5 rows and 4 columns

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [22]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [23]:
df.iloc[3,1]

-0.758872056210466

# selection and indexing

In [24]:
df[['W','Z','Y']]

          W         Z         Y
A  2.706850  0.503826  0.907969
B  0.651118  0.605965 -0.848077
C -2.018168 -0.589001  0.528813
D  0.188695  0.955057 -0.933237
E  0.190794  0.683509  2.605967

In [25]:
# select row list 
df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

# creating a new column

In [26]:
df['Sum']=df['W']+df['X']+df['Y']+df['Z']
df

          W         X         Y         Z       Sum
A  2.706850  0.628133  0.907969  0.503826  4.746778
B  0.651118 -0.319318 -0.848077  0.605965  0.089688
C -2.018168  0.740122  0.528813 -0.589001 -1.338233
D  0.188695 -0.758872 -0.933237  0.955057 -0.548357
E  0.190794  1.978757  2.605967  0.683509  5.459028

In [27]:
#selecting rows and columns
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [28]:
#finding the location
df.iloc[2,1]

0.7401220570561068

In [29]:
# removing a column
df.drop('Sum',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df

          W         X         Y         Z       Sum
A  2.706850  0.628133  0.907969  0.503826  4.746778
B  0.651118 -0.319318 -0.848077  0.605965  0.089688
C -2.018168  0.740122  0.528813 -0.589001 -1.338233
D  0.188695 -0.758872 -0.933237  0.955057 -0.548357
E  0.190794  1.978757  2.605967  0.683509  5.459028

In [31]:
#removes the row parmanently,as x=0 for rows and columns =1

In [32]:
df

          W         X         Y         Z       Sum
A  2.706850  0.628133  0.907969  0.503826  4.746778
B  0.651118 -0.319318 -0.848077  0.605965  0.089688
C -2.018168  0.740122  0.528813 -0.589001 -1.338233
D  0.188695 -0.758872 -0.933237  0.955057 -0.548357
E  0.190794  1.978757  2.605967  0.683509  5.459028

In [33]:
#removing rows but not parmanently
df.drop('E',axis=0)

          W         X         Y         Z       Sum
A  2.706850  0.628133  0.907969  0.503826  4.746778
B  0.651118 -0.319318 -0.848077  0.605965  0.089688
C -2.018168  0.740122  0.528813 -0.589001 -1.338233
D  0.188695 -0.758872 -0.933237  0.955057 -0.548357

In [34]:
 # assignmnt drop and store values of any

In [35]:
df.drop('Z')# DROPPING Z

KeyError: "['Z'] not found in axis"

In [ ]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [ ]:
df1=df.drop('E',axis=0,inplace=True)

In [ ]:
df

# conditional statement selection

In [ ]:
df

In [ ]:
df>1

In [ ]:
df>3

def>2

In [ ]:
df>2

In [ ]:
# reset index to default
df.reset_index()

In [ ]:
newid='AB CD EF GH'.split()

In [ ]:
df['state']=newid

In [ ]:
df

In [ ]:
#adding new row
newidRow='AB CD EF Eg HK'.split()
df.loc['F']=newidRow
df

In [ ]:
df.set_index('state',inplace =True)

In [ ]:
df

In [87]:
allan=pd.DataFrame(randn(4,4),index='A B C D'.split(),columns = 'E F G H'.split())
allan

          E         F         G         H
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [ ]:
allan.loc['A']

df3=pd.DataFrame({'A':['A1','A2','A3'],'B':['B1','B2','B3','B4'],'C':['C1','C2','C3','C4'], 'D':'D1','D2','D3','D4'})
index=[0, 1, 2,]

In [85]:

df3=pd.DataFrame({'A':['A1','A2','A3','A4'],'B':['B1','B2','B3','B4'],'C':['C1','C2','C3','C4'], 'D':['D1','D2','D3','D4']},
index=[0,1,2,3])

df3

In [86]:
df3

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4

In [ ]:

df4=pd.DataFrame({'A':['A1','A2','A3','A4'],'B':['B1','B2','B3','B4'],'C':['C1','C2','C3','C4'], 'D':['D1','D2','D3','D4']},
index=[4,5,6,7])

In [ ]:
df4

# concatenation
you can use ``pd.concat`` and pass in the list of dataFrames to concat together

In [ ]:
pd.concat([df3,df4])
# CONCATINATING ROWS

In [ ]:
pd.concat([df3,df4],axis=1)
# CONCATINATING COLUMNS BY EQUATING AXIS=1


# marging
the merge function allows you to merge dataframes together using similar logic using a similar logic like sql table together

In [ ]:

left=pd.DataFrame({'key':['A0','A1','A2','A3'],'B':['B1','B2','B3','B4'],'C':['C1','C2','C3','C4'], 'D':['D1','D2','D3','D4']})

In [ ]:
left

In [ ]:

right=pd.DataFrame({'key':['A0','A1','A2','A3'],'B':['B1','B2','B3','B4'],'C':['C1','C2','C3','C4'], 'D':['D1','D2','D3','D4']})

In [ ]:
right

In [ ]:
pd.merge(right,left,how='inner')

In [ ]:
pd.merge(right,left,how='inner',on='key')

# DATA INPUT AND OUTPUT

In [ ]:
### LOADING THE CSV FILEB
load_csv=pd.read_csv('Cars Revised (2).csv')
load_csv

In [ ]:
load_csv.shape

In [ ]:
load_csv.head()
#brings 5 values
#if you want several values you have to specify

In [ ]:
load_csv.tail()
#last 5 values

In [ ]:
load_csv.head(10)
# 10 values

In [ ]:
load_csv.describe()
# returns statistical values

In [ ]:
load_csv.corr()

In [ ]:
import seaborn as sns
sns.heatmap(load_csv.corr())

In [ ]:
#loading the excell file
load_excel=pd.read_excel('form1.xlsx', 'Grade Summaries')
load_excel

In [ ]:
#loading the html file
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [ ]:
#get html page
page=requests.get('https://www.must.ac.ke/kuccps-2019-admission-list-2/"')
soup=BeautifulSoup(page.text,'lxml')
soup

In [ ]:
#getting the table content
table=soup.find('table')
headers=[]
for row in table.find_all('tr')[1:]:
    data=row.find_all('td')
    tittles=[td.text.strip() for td in data]
    headers.append(tittles)
df=pd.DataFrame(columns = headers)
df

In [ ]:
#getting the table content
for row in table.find_all('tr')[1:]:
    row_data=row.find_all('td')
    content=[td.text for td in row_data]
    length = len(df)
    df.loc[length]=content
df

In [ ]:
df.to_csv('allan.csv')

In [ ]:
df.to_excel('form.xlsx')

# MISSING DATA

In [36]:
dataframe=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,5]})
dataframe

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  5

In [37]:
dataframe.isnull()
# returns missing value as true or false

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [39]:
dataframe.isnull().sum()
# returns sumof mising value columnwise

A    1
B    2
C    0
dtype: int64

In [40]:


#sum of missing elements(row and column)
dataframe.isna().sum().sum()

3

In [41]:
#same as
dataframe.isnull().sum().sum()

3

In [42]:
# isna and isnull is the same

#  methods of dealing with missing data
* dropping null values

In [43]:
#dropping the null values
dataframe.dropna()
#dropping all rows

     A    B  C
0  1.0  5.0  1

In [46]:
dataframe

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  5

In [47]:
# drop columnwise
dataframe.dropna(axis=1)

   C
0  1
1  2
2  5

In [48]:
dataframe.dropna(axis=0) #rows =0 for rows

     A    B  C
0  1.0  5.0  1

In [49]:
dataframe

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  5

# thresh checks and returns non null values

In [50]:
#returns non null values more than 2 in 
dataframe.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  5

In [51]:
dataframe.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

# 2.Filling the value with specific value
# Filling the null values with "FILL VALUE"

In [52]:
dataframe.fillna(value ='FILL VALUE' )

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  5

In [ ]:
dataframe.fillna(value =0.5 )

# 3. The replace () method.

 * you can replace te nan value in a specific column with mean, median, mode.
 * method for replacing values with the mean.
 * df[a].replace([numpy]), df[A].mean(), inplace=True)

In [ ]:
 # depending in row and column

In [54]:
dataframe1=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,5]})
dataframe1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  5

In [55]:
dataframe1['A'].fillna(value=dataframe1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [56]:
dataframe1['B'].fillna(value=4)

0    5.0
1    4.0
2    4.0
Name: B, dtype: float64

In [ ]:
dataframe1['A'].fillna(value=dataframe1['A'].mode()[0])

dataframe1['A'].fillna(value=dataframe1['A'].std())

In [ ]:
dataframe1['A'].fillna(value=dataframe1['A'].var())

#  4.Interpolation Methods

In [57]:
#interpolation method include
dataframe1.interpolate()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  5

In [64]:
dataframe2=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,5]})
dataframe2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  5

In [58]:
dataframe1.interpolate()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  5

In [62]:
dataframe1.interpolate(method='pad',limit=10)

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  5

# 5.replacing missing values with last know forward and backward filling.

In [65]:
# forward filling (latest value)
dataframe4=dataframe2.ffill()
dataframe4

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  5

In [66]:
dataframe5=dataframe4.bfill()
dataframe5

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  5

# Group by

In [67]:
# create a dataframe
data = pd.DataFrame({'company':['Google','Google','Microsoft','microsoft','Facebook','Facebook'],'person':['chacha','omondi','Nathan','matthew','daniel','Allan'],'sales':[200,450,350,220,520,128]})
data

     company   person  sales
0     Google   chacha    200
1     Google   omondi    450
2  Microsoft   Nathan    350
3  microsoft  matthew    220
4   Facebook   daniel    520
5   Facebook    Allan    128

In [71]:
# now we use groupby()metod to group together based on a common column name
by_company=data.groupby('company')
by_company

In [70]:
by_company.mean()
# finds the mean between the two then it evaluates the results

           sales
company
Facebook     324
Google       325
Microsoft    350
microsoft    220

In [72]:
by_company.min()
# groups the data according to the min values

            person  sales
company
Facebook     Allan    128
Google      chacha    200
Microsoft   Nathan    350
microsoft  matthew    220

In [ ]:
by_company.max()

In [73]:
by_company.count()

           person  sales
company
Facebook        2      2
Google          2      2
Microsoft       1      1
microsoft       1      1

In [74]:
by_company.describe()

          sales
          count   mean         std    min    25%    50%    75%    max
company
Facebook    2.0  324.0  277.185858  128.0  226.0  324.0  422.0  520.0
Google      2.0  325.0  176.776695  200.0  262.5  325.0  387.5  450.0
Microsoft   1.0  350.0         NaN  350.0  350.0  350.0  350.0  350.0
microsoft   1.0  220.0         NaN  220.0  220.0  220.0  220.0  220.0

In [ ]:
#rows takes columns
by_company.describe().transpose()

In [ ]:
# transposes the google
by_company.describe().transpose()['Google']

In [98]:
import pandas as 

my_data=pd.DataFrame(randn(10,100), index= 'Allan Wekesa Oscar Felix Eric'.split(),columns='maths  eng kis sci sstre'.split)
my_data

SyntaxError: invalid syntax (<ipython-input-98-64abe0c3b1d7>, line 1)

In [6]:
import pandas as pd
import numpy as np
from numpy.random import randn
my_data=pd.DataFrame(randn(5,5), index= 'Allan Wekesa Oscar Felix Eric'.split(),columns='maths  eng kis sci sstre'.split())
my_data

           maths       eng       kis       sci     sstre
Allan   0.175999 -0.729532 -1.968792 -0.712077 -1.866772
Wekesa  0.061473 -0.767643  1.221536 -0.098542 -0.407040
Oscar   0.551786 -2.139105 -0.148632 -1.038038  0.731566
Felix  -2.384670  1.437711  0.472196  1.021814 -1.025498
Eric    0.092134  2.520514  1.078694  2.538501 -1.331774

In [110]:
my_data.shape

(5, 5)

In [113]:
my_data.describe()

          maths       eng       kis       sci     sstre
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean  -0.314800 -0.234815 -0.144118 -0.618540  0.468830
std    0.992473  1.136893  1.151966  0.959064  1.099830
min   -1.733096 -1.443217 -1.690617 -1.613579 -1.232435
25%   -0.544439 -0.983310 -0.756352 -1.356399  0.055676
50%   -0.455947 -0.668172  0.007315 -0.612939  0.750445
75%    0.222400  0.731000  0.357508 -0.326238  1.299748
max    0.937082  1.189622  1.361556  0.816454  1.470714

In [114]:
my_data.transpose()

          Allan    Wekesa     Oscar     Felix      Eric
maths  0.937082  0.222400 -0.455947 -0.544439 -1.733096
eng    0.731000 -1.443217  1.189622 -0.668172 -0.983310
kis    1.361556 -0.756352 -1.690617  0.007315  0.357508
sci   -0.326238  0.816454 -1.356399 -0.612939 -1.613579
sstre  0.055676  0.750445 -1.232435  1.299748  1.470714

In [115]:
my_data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
maths,5.0,-0.314800,0.992473,-1.733096,-0.544439,-0.455947,0.222400,0.937082
eng,5.0,-0.234815,1.136893,-1.443217,-0.983310,-0.668172,0.731000,1.189622
kis,5.0,-0.144118,1.151966,-1.690617,-0.756352,0.007315,0.357508,1.361556
sci,5.0,-0.618540,0.959064,-1.613579,-1.356399,-0.612939,-0.326238,0.816454
sstre,5.0,0.468830,1.099830,-1.232435,0.055676,0.750445,1.299748,1.470714

In [116]:
my_data.corr()

          maths       eng       kis       sci     sstre
maths  1.000000  0.336775  0.224808  0.696259 -0.397963
eng    0.336775  1.000000 -0.085891 -0.403635 -0.854268
kis    0.224808 -0.085891  1.000000  0.046245  0.486381
sci    0.696259 -0.403635  0.046245  1.000000  0.129499
sstre -0.397963 -0.854268  0.486381  0.129499  1.000000

In [117]:
my_data.isna()

        maths    eng    kis    sci  sstre
Allan   False  False  False  False  False
Wekesa  False  False  False  False  False
Oscar   False  False  False  False  False
Felix   False  False  False  False  False
Eric    False  False  False  False  False

In [118]:
my_data.head(2)

           maths       eng       kis       sci     sstre
Allan   0.937082  0.731000  1.361556 -0.326238  0.055676
Wekesa  0.222400 -1.443217 -0.756352  0.816454  0.750445

In [119]:
my_data.tail()

           maths       eng       kis       sci     sstre
Allan   0.937082  0.731000  1.361556 -0.326238  0.055676
Wekesa  0.222400 -1.443217 -0.756352  0.816454  0.750445
Oscar  -0.455947  1.189622 -1.690617 -1.356399 -1.232435
Felix  -0.544439 -0.668172  0.007315 -0.612939  1.299748
Eric   -1.733096 -0.983310  0.357508 -1.613579  1.470714

In [126]:
ddata=pd.DataFrame(data=[[1,2,3,4,5],[4,np.nan,5,np.nan,6],[np.nan,0,np.nan,2,7],[8,9,0,7,34],[12,np.nan,np.nan,45,49]],index='A B C D E'.split(),columns='MAT ENG KIS CHEM BIO'.split())
ddata

    MAT  ENG  KIS  CHEM  BIO
A   1.0  2.0  3.0   4.0    5
B   4.0  NaN  5.0   NaN    6
C   NaN  0.0  NaN   2.0    7
D   8.0  9.0  0.0   7.0   34
E  12.0  NaN  NaN  45.0   49

In [131]:
ddata.isna()

     MAT    ENG    KIS   CHEM    BIO
A  False  False  False  False  False
B  False   True  False   True  False
C   True  False   True  False  False
D  False  False  False  False  False
E  False   True   True  False  False

In [138]:
ddata.dropna()

   MAT  ENG  KIS  CHEM  BIO
A  1.0  2.0  3.0   4.0    5
D  8.0  9.0  0.0   7.0   34

In [140]:
ddata.isna().sum()

MAT     1
ENG     2
KIS     2
CHEM    1
BIO     0
dtype: int64

In [141]:
ddata.isna().sum().sum()

6

In [142]:
ddata.dropna(axis=1)

   BIO
A    5
B    6
C    7
D   34
E   49

In [150]:
ddata.ffillna(value =['B'].mean() )

AttributeError: 'DataFrame' object has no attribute 'ffillna'

# Data visualization
## Seaborn 
* jontplots()

In [9]:
my_data
my_data['Mean']=my_data['maths']+my_data['eng']+my_data['kis']+my_data['sci']+my_data['sstre']
my_data

           maths       eng       kis       sci     sstre      Mean
Allan   0.175999 -0.729532 -1.968792 -0.712077 -1.866772 -5.101173
Wekesa  0.061473 -0.767643  1.221536 -0.098542 -0.407040  0.009784
Oscar   0.551786 -2.139105 -0.148632 -1.038038  0.731566 -2.042423
Felix  -2.384670  1.437711  0.472196  1.021814 -1.025498 -0.478446
Eric    0.092134  2.520514  1.078694  2.538501 -1.331774  4.898069

import seaborn as sns
import matplotlib.pyplot as plt
my_data=sns.distplot(my_data['Mean'],y='index',kind='kde')
plt.show()

In [ ]:
datta=sns.

In [22]:
plot=sns.lmplot(x="x",y="y",data=my_data)

TypeError: 'AxesSubplot' object is not subscriptable